In [11]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import statsmodels.api as sm
from scipy import stats

In [8]:
df = pd.read_csv('../../toydata/titanic.csv')
print(f"{df.shape}")
df.head(1)

(891, 15)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.25,S,Third,man,True,NaN,Southampton,no,False

### arith, math funcs

In [33]:
idx = df.eval('fare != 0')
df.loc[idx, 'log_fare'] = df.loc[idx, :].eval('log(fare)')
df.head(1)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,log_fare
0,0,3,male,22.0,1,0,7.25,S,Third,man,True,NaN,Southampton,no,False,1.981001

### filter via boolean, compare

In [48]:
df[df.eval("pclass == 1")].shape

(216, 16)

In [50]:
df[df.eval("embark_town == 'Southampton'")].shape

(644, 16)